@echo off
chcp 65001

mkdir "Лабораторні\Група\ПІБ\Командний рядок\Прихована папка"
mkdir "Лабораторні\Група\ПІБ\Командний рядок\Не прихована папка"
attrib +h "Лабораторні\Група\ПІБ\Командний рядок\Прихована папка"

xcopy /? > "Лабораторні\Група\ПІБ\Командний рядок\Не прихована папка\copyhelp.txt"

xcopy "Лабораторні\Група\ПІБ\Командний рядок\Не прихована папка\copyhelp.txt" "Лабораторні\Група\ПІБ\Командний рядок\Прихована папка\copied_copyhelp.txt"

mkdir "Лабораторні\Група\ПІБ\batch"
mkdir "Лабораторні\Група\ПІБ\batch\Прихована папка"
mkdir "Лабораторні\Група\ПІБ\batch\Не прихована папка"
attrib +h "Лабораторні\Група\ПІБ\batch\Прихована папка"

xcopy /? > "Лабораторні\Група\ПІБ\batch\Не прихована папка\copyhelp.txt"

xcopy "Лабораторні\Група\ПІБ\batch\Прихована папка\copyhelp.txt" "Лабораторні\Група\ПІБ\Командний рядок\Прихована папка\copied_copyhelp.txt"

dir /s /t:w
pause